---
layout: single
title:  "대회일지"
---

# 2022.10.05

같은 동아리 팀원들과 함께 스터디를 구성하여 대회에 참여한 이후 대회 준비 과정을 적으려고 한다.  
9월 한 달을 총 달렸다.

팀원들과 밤을 새우며 대회를 준비했다.  
대회에 참가하여 좋은 점수를 얻기 위해 공부하고 이해하고 노력했다는 것만으로도 좋은 경험이었다.  
실력을 올릴 수 있었던 기회였고, 대회를 참가하는 것이 실력을 올리는 최고의 방법이라고 생각한다.  
현재는 대회가 끝났지만, 대회를 준비하며 분석할 때 중요했던 부분이나 기억에 남는 것, 많이 고민했던 부분(오류 등)에 대해 정리하고자 한다.  
이번 대회의 데이터가 깔끔하지 않아서 준비하기가 너무 힘들었고 설명도 적어서 지금까지 해본 대회 중에 최고로 힘들었던 대회였다.

우선 나는피쳐엔지니어링 부분을 맡았고 나만의 인사이트를 도출하여 새로운 피쳐들을 생성시켜줬다.  
내가 맡은 부분인 피쳐엔지니어링 부분과 나만의 인사이트는 따로 글을 쓸 것이다.

또, xgb 모델을 사용할 수 있게끔 도움을 줬다.  
이 부분은 예전에 대회에서 xgb를 사용한 적이 있어서 그 코드를 이용해 구해줬다.
```python
xgb.XGBRegressor(objective='reg:squarederror', n_estimators = 3000, tree_method='gpu_hist')
```
기존 모델(랜덤포레스트)보다 xgb를 사용하니 더 예측력이 향상됐다.

다음 대회는 아직 초보이다보니까 내 실력을 최대한 발휘할 수 있고, 설명이 잘되어있어 이해하기 쉬운 대회에 참가해야겠다.  
오늘은 이정도만 적고 다음에 피쳐엔지니어링 부분과 나만의 인사이트를 이야기하겠다.
